{
  "results": [
  	{
  		"symbol": "A", 
  		"meaning": "To see the letter \"A\" in your dream represents the beginning of a new stage. You are moving on to something new and grand. Alternatively, the letter \"A\" invokes feelings of superiority and grandeur. It may indicate the name or initial of a person."
  	},
  	{
  		"symbol": "Abandonment", 
  		"meaning": "To dream that you are abandoned suggests that it is time to leave behind past feelings and characteristics that are hindering your growth. Let go of your old attitudes. A more direct and literal interpretation of this dream indicates you have a fear of being deserted, abandoned, or even betrayed. It may stem from a  recent loss or a fear of losing a loved one. The fear of abandonment may manifest itself into your dream as part of the healing process and dealing with losing a loved one. It may also stem from unresolved feelings or problems from childhood. Alternatively, the dream indicates that you are feeling neglected or that your feelings are being overlooked. Perhaps the dream is a metaphor that you need to approach life with \"reckless abandon\" and live more freely." 
  	},
  	{
  		"symbol": "Abduction", 
  		"meaning": "To dream of being abducted indicates that you are being manipulated by your circumstances or by someone. You lack control of your own life."
  	},
  	{
  		"symbol": "Skateboard", 
  		"meaning": "To see or ride a skateboard in your dream indicates that you have the gift of making any difficult situation look easy. You carry yourself with style, grace and composure in the hardest of situations. Alternatively, the dream signifies your free and fun-loving side."
  	},
  	{
  		"symbol": "Smoothie", 
  		"meaning": "To make or drink a smoothie in your dream is analogous to how your life is going. It is a \"smooth\" road ahead for you."
  	},
  	{
  		"symbol": "Snowman", 
  		"meaning": "To see a snowman in your dream suggests that you are emotionally cold or frigid. Perhaps you have been a little cold-hearted and insensitive. Alternatively, a snowman is symbolic of playfulness, holiday cheer and time of togetherness."
  	},
  	{
  		"symbol": "Milk", 
  		"meaning": "To see milk in your dream symbolizes maternal instincts and motherly love. It also denotes human kindness,  wholesomeness, and compassion. Alternatively, the dream may be a metaphor that someone is \"milking\" you, either emotionally or financially"
  	},
  	{
  		"symbol": "Zebra", 
  		"meaning": "To see a zebra in your dream represents perfect balance, unity and harmony. It also indicates that opposites attract. Alternatively, a zebra suggests that you are spending too much time in trivial matters. You need to establish a clear timeline and lay your groundwork for success."
  	},
  	{
  		"symbol": "Tiger", 
  		"meaning": "To see a tiger in your dream represents power and your ability to exert it in various situations. The dream may also indicate that you need to take more of a leadership role. Alternatively, the tiger represents female sexuality, aggression, and seduction.  "
  	},
  	{
  		"symbol": "Cat", 
  		"meaning": "To see a cat in your dream symbolizes an independent spirit, feminine sexuality, creativity, and power. It also represents misfortune and bad luck. The dream symbol has different significance depending on whether you are a cat lover or not. The cat could indicate that someone is being deceitful or treacherous toward you. If the cat is aggressive, then it suggests that you are having problems with the feminine aspect of yourself. If you are afraid of the cat in your dream, then it suggests that you are fearful of the feminine. The dream may be a metaphor for \"cattiness\" or someone who is \"catty\" and malicious. If you see a cat with no tail, then it signifies a loss of independence and lack of autonomy. "
  	}
] }